[]
=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa

[DragMacroForm]
lb_GameDirectory_ODME->Caption=Select Game
GameManagement=File Options
GameManagement_New=New folder
GameManagement_Modify=Edit folder
GameManagement_Delete=Delete folder
FileManagement_New=New
FileManagement_Open=Open
FileManagement_Save=Save
FileManagement_SaveAs=Save as
FileManagement_Delete=Delete
FileManagement_ReName=Rename
FileManagement_ImportExport=Import In/Out
FileManagement_Transfer=Up/Download
lb_FileName_ODME->Caption=File Name
lb_CommandArea_ODME->Caption=Command@RETURN@   Zone
lb_SimulateArea_ODME->Caption=Simulation Zone
lb_MacroArea_ODME->Caption=Macro Zone
lb_TimeCount_ODME->Caption=:Preset Delay Time(ms)
htmlb_Statement1->Caption=OSCAR II Programming Guide:
htmlb_Statement2->Caption=To make a new macro, follow these steps:@RETURN@1) Choose your SIMULATION COMMAND from the COMMAND ZONE.@RETURN@2) Drag and drop your SIMULATION COMMAND using your LEFT MOUSE BUTTON.@RETURN@3) Fine-tune your command string in the MACRO ZONE and save the file for later use.
htmlb_Statement3->Caption=Keyboard - Simulates keystrokes.
htmlb_Statement4->Caption=Mouse - Simulates mouse clicks.
htmlb_Statement5->Caption=Action - Simulates cursor movements.
htmlb_Statement6->Caption=Control - Insert key strokes, clicks, time delays, varibles, loops, etc.
htmlb_Statement7->Caption=Operation - Insert variations of keyboard, mouse, etc.
bt_ResumeMacroI_ODME->Caption=Go to [Oscar I]
bt_DownloadExplain_ODME->Caption=Manual
lb_KeyboardInput_ODME->Caption=Physical keyboard input
//Keyboard=
bt_K041_ODME->Caption=ESC
bt_K058_ODME->Caption=F1
bt_K059_ODME->Caption=F2
bt_K060_ODME->Caption=F3
bt_K061_ODME->Caption=F4
bt_K062_ODME->Caption=F5
bt_K063_ODME->Caption=F6
bt_K064_ODME->Caption=F7
bt_K065_ODME->Caption=F8
bt_K066_ODME->Caption=F9
bt_K067_ODME->Caption=F10
bt_K068_ODME->Caption=F11
bt_K069_ODME->Caption=F12
                =
bt_K053_ODME->Caption=~ `
bt_K030_ODME->Caption=<1>
bt_K031_ODME->Caption=<2>
bt_K032_ODME->Caption=<3>
bt_K033_ODME->Caption=<4>
bt_K034_ODME->Caption=<5>
bt_K035_ODME->Caption=<6>
bt_K036_ODME->Caption=<7>
bt_K037_ODME->Caption=<8>
bt_K038_ODME->Caption=<9>
bt_K039_ODME->Caption=<0>
bt_K045_ODME->Caption=_ -
bt_K046_ODME->Caption=+ @equ@
bt_K042_ODME->Caption=back
bt_K043_ODME->Caption=Tab
bt_K020_ODME->Caption=Q
bt_K026_ODME->Caption=W
bt_K008_ODME->Caption=E
bt_K021_ODME->Caption=R
bt_K023_ODME->Caption=T
bt_K028_ODME->Caption=Y
bt_K024_ODME->Caption=U
bt_K012_ODME->Caption=I
bt_K018_ODME->Caption=O
bt_K019_ODME->Caption=P
bt_K047_ODME->Caption={ [
bt_K048_ODME->Caption=} ]
bt_K049_ODME->Caption=| \
bt_K057_ODME->Caption=Caps
bt_K004_ODME->Caption=A
bt_K022_ODME->Caption=S
bt_K007_ODME->Caption=D
bt_K009_ODME->Caption=F
bt_K010_ODME->Caption=G
bt_K011_ODME->Caption=H
bt_K013_ODME->Caption=J
bt_K014_ODME->Caption=K
bt_K015_ODME->Caption=L
bt_K051_ODME->Caption=; :
bt_K052_ODME->Caption='
bt_K040_ODME->Caption=Enter
bt_K265_ODME->Caption=Shift
bt_K029_ODME->Caption=Z
bt_K027_ODME->Caption=X
bt_K006_ODME->Caption=C
bt_K025_ODME->Caption=V
bt_K005_ODME->Caption=B
bt_K017_ODME->Caption=N
bt_K016_ODME->Caption=M
bt_K054_ODME->Caption=< ,
bt_K055_ODME->Caption=> .
bt_K056_ODME->Caption=? /
bt_K269_ODME->Caption=RShift
bt_K264_ODME->Caption=Ctrl
bt_K267_ODME->Caption=LW
bt_K266_ODME->Caption=Alt
bt_K044_ODME->Caption=Space
bt_K270_ODME->Caption=RAlt
bt_K271_ODME->Caption=RW
bt_K101_ODME->Caption=MENU
bt_K268_ODME->Caption=RCtrl
bt_K070_ODME->Caption=Print
bt_K071_ODME->Caption=Scroll
bt_K072_ODME->Caption=Pause
bt_K073_ODME->Caption=Insert
bt_K074_ODME->Caption=Home
bt_K075_ODME->Caption=Up
bt_K076_ODME->Caption=Delete
bt_K077_ODME->Caption=End
bt_K078_ODME->Caption=Down
bt_K082_ODME->Caption=^
bt_K080_ODME->Caption=<
bt_K081_ODME->Caption=v
bt_K079_ODME->Caption=>
bt_K083_ODME->Caption=LOCK
bt_K084_ODME->Caption=/
bt_K085_ODME->Caption=*
bt_K086_ODME->Caption=-
bt_K095_ODME->Caption=<7>
bt_K096_ODME->Caption=<8>
bt_K097_ODME->Caption=<9>
bt_K087_ODME->Caption=+
bt_K092_ODME->Caption=<4>
bt_K093_ODME->Caption=<5>
bt_K094_ODME->Caption=<6>
bt_K089_ODME->Caption=<1>
bt_K090_ODME->Caption=<2>
bt_K091_ODME->Caption=<3>
bt_K088_ODME->Caption=Enter
bt_K098_ODME->Caption=<0>
bt_K099_ODME->Caption=Del
AbsoluteMoveBrick->Text=Move to x :           y :
RelativeMoveBrick->Text=Relative move x :             y :
FlagBrick->Text=Flags
GotoBrick->Text=Goto Flag
CommentBrick->Text=Comments
ReProgramBrick->Text=Press Start                     Stop
DelayBrick->Text=Delay
IfBrick->Text=IF
IfKeyBrick->Text=If the state of                 is
ForBrick->Text=Repeat           Times
PlusBrick->Text=%B26+
MinusBrick->Text=%B26-
AndBrick->Text=%B26&
OrBrick->Text=%B26|
XorBrick->Text=%B26^
KeyBrick->Text=KB:Delay            ms
LeftKeyBrick->Text=Left Button:Delay            ms
RightKeyBrick->Text=Right Button:Delay            ms
MiddleKeyBrick->Text=Middle Button:Delay            ms
FourthKeyBrick->Text=4th Button:Delay            ms
FifthKeyBrick->Text=5th Button:Delay            ms
ForwardScrollBrick->Text=Forward           Grid
BackwardScrollBrick->Text=Backward           Grid
MenuItem[0]->Caption=Click
MenuItem[1]->Caption=Down
MenuItem[2]->Caption=Up
MenuItem[3]->Caption=Release
MenuItem[4]->Caption=Re-press
MenuItem[5]->Caption=VariableA
MenuItem[6]->Caption=VariableB
MenuItem[7]->Caption=VariableC
MenuItem[8]->Caption=VariableD
MenuItem[9]->Caption="@equ@@equ@"
MenuItem[10]->Caption="!@equ@"
MenuItem[11]->Caption=Number
MenuItem[12]->Caption=ms
MenuItem[13]->Caption=Sec
MenuItem[14]->Caption=Min
MenuItem[15]->Caption=Key1
MenuItem[16]->Caption=Key2
MenuItem[17]->Caption=Key3
MenuItem[18]->Caption=Key4
MenuItem[19]->Caption=Key5
MenuItem[20]->Caption=Key6
MenuItem[21]->Caption=Key7
MenuItem[22]->Caption=Key8
MenuItem[23]->Caption=Key9
MenuItem[24]->Caption=Key10
MenuItem[25]->Caption=Key11
MenuItem[26]->Caption=Key12
MenuItem[27]->Caption=Key13
MenuItem[28]->Caption=Key14
MenuItem[29]->Caption=Key15
MenuItem[30]->Caption=Key16
MenuItem[31]->Caption=Key17
MenuItem[32]->Caption=Key18
MenuItem[33]->Caption=Key19
MenuItem[34]->Caption=Key20
MenuItem[35]->Caption=Key21
MenuItem[36]->Caption=Key22
MenuItem[37]->Caption=Key23
MenuItem[38]->Caption=Key24
MenuItem[39]->Caption=Press
MenuItem[40]->Caption=Release
NewGameNameTitle=New folder
NewGameNameDefault=New folder
ModifyGameNameTitle=Edit folder
DeleteGameFileConfirm=Delete this game folder? Files contains in the directory will be deleted as well.
DeleteGameFileSelected=File / directory has been applied to all the core mouse memory, do you want to delete / rename it? If “YES” is elected,  the feature will be removed!
RenameGameNameSelected=File / directory has been applied to all the core mouse memory, do you want to delete / rename it? If “YES” is elected,  the feature will be removed!
PleaseCreateDirectory=Please create game folder!
NewCreateFileName=New file
NewCreateFileDefault=New file
RenameMacroName=Rename
PleaseInputMacroName=Input name
MacroExistAlready=File exist, replace?
MustCreatFile=You must create a new macro file to edit!
VersionMessage=Read version, file can not be saved!
MacroDeleteFile=Delete file permanently?
MacroSelectFile=File / Folder has been applied to Mouse memory, whether you want to delete / rename? If  [Yes] the function will delete!
MacroUsed=File / Folder has been applied to Mouse memory, whether you want to delete / rename? If  [Yes] the function will delete!
MacroModify=The file has been modified. Save?
InputNameInvalid=Invalid character detected[eg., \ / : * ? " < > | ].
TrialAccessDeny=Thanks for viewing [HEADSHOT]! Can not apply! Please purchase Ultra-Core3 activation code online!@RETURN@(Bloody7 software is for Bloody mouse V or R series only!)
FileRowsExceedsUpperLimit=The number of lines in this file exceeds the limit. Please reconfigure your settings.
IsCoverSameNameFile=The filename being saved already exists.  Overwrite?
CanNotTransformOscarII=This [OSCAR I] file cannot be converted to [OSCAR II]. Please open [OSCAR I] under the MACRO tab.
FileRowsMayExceedsUpperLimit=The file has been saved. More than 1000 instructions may not be apply to the device memory.
CPIRemarkDefault=Default
bt_Save_ODME->Hint=Save
bt_Undo_ODME->Hint=Undo
bt_Redo_ODME->Hint=Redo
bt_Record_ODME->Hint=Record
rb_RepeatType_ODME->Hint=Non-repeat  
rb_RepeatType1_ODME->Hint=Press:Start@RETURN@Release:Stop
rb_RepeatType2_ODME->Hint=Press:Start @RETURN@Re-press:Stop
pmnV_Cut->Caption=Cut
pmnV_Copy->Caption=Copy
pmnV_Paste->Caption=Paste
pmnV_Delete->Caption=Delete
pmnV_SetDelay->Caption=Change "Delay" Values
pmnV_SetAllDelay->Caption=Change All "Delay" Values
pmnV_ClearAll->Caption=Clear all
//按鍵測試區=
lb_MouseKeyTest->Caption=Key queries
PleasePressKey=Press mouse button please
MouseKeyUnknown=Unrecognized

[DrawMacroEditRecord]
bt_Start->Caption=<F11> to start 
bt_Stop->Caption=<F12> to stop 
cb_AxisAbsolute->Caption=Record mouse absolute movement
cb_AxisRelatively->Caption=Record mouse relative movement
cb_KeyboardAction->Caption=Record keyboard operation
cb_MouseClick->Caption=Record mouse clicking

[DrawMacroEditStatement]
lb_Title->Caption=All fields are required!
lb_Software->Caption=Applicable software (ex CS)
lb_Statement->Caption=Describe
lb_Comment->Caption=Function Description 
mi_EditerCut->Caption=Cut       Ctrl+X
mi_EditerCopy->Caption=Copy      Ctrl+C
mi_EditerPaste->Caption=Paste     Ctrl+P
lb_EditComment->Caption1=Please Complete Your  File Information
lb_EditComment->Caption2=Edit note
lb_Resolution->Caption=Resolution
lb_CPIRemark->Caption=Sensitivity

[DrawMacroInstructions]
lb_TestDescription->Caption=Data will be stored in the mouse 4th key’s memory temporarily. While in the test zone or in the game test, to resume default 4th key setting, please go to “Key page” and reset it again
ck_CursorRecord->Caption=Initiate cursor recording
lb_InterruptTips->Caption=In case the test program out of control, press [Caps Lock]+[Scroll Lock]+[Num Lock] to interrupt it, then debug the program again.
lb_TestCommon->Caption=Describe
PressSpaceToTest=Press 4th key to start testing
Key=Key
KeyDown=Press
KeyUp=Release
MouseMoveTo=Mouse_move_to
MouseRelativeMove=Mouse_relative_move
Delay=Delay
millisecond=ms
second=Sec
minute=Min
MouseWhellUp=Scroll_up
MouseWhellDown=Scroll_down
MouseLeftKeyDown=Press_left_key
MouseLeftKeyUp=Release_left_key
MouseLeftKeyClick=Click_left_key
MouseLeftKeyDblClick=Double_click_left_key
MouseMiddleKeyDown=Press_middle_key
MouseMiddleKeyUp=Release_middle_key
MouseMiddleKeyClick=Click_middle_key
MouseRightKeyDown=Press_right_key
MouseRightKeyUp=Release_right_key
MouseRightKeyClick=Click_right_key
MouseFourthKeyDown=Press_4th_key
MouseFourthKeyUp=Release_4th_key
MouseFourthKeyClick=Click_4th_key
MouseFifthKeyDown=Press_5th_key
MouseFifthKeyUp=Release_5th_key
MouseFifthKeyClick=Click_5th_key

[DrawMacroEditFileDialog]
lb_Directory->Caption=Game
lb_FileName->Caption=File
lb_Title->Caption1=Open
lb_Title->Caption2=Save
lb_Title->Caption3=Save as
lb_Title->Caption4=Delete
lb_Title->Caption5=Delete
lb_FileType->Caption=Type
advcb_FileType->Caption1=All Macro file *.*
advcb_FileType->Caption2=*.amc (Macro)
advcb_FileType->Caption3=*.amc2 (Macro)
advcb_FileType->Caption4=*.mgn (Macro gun)
advcb_FileType->Caption5=*.mgn2 (Macro gun)
NoAuthorityUse=Insufficient authority, export failed!

[DragMacroEditDelaySetForm]
lb_DelayTime->Caption=Time(ms)

